wdx04/mbed-os/targets/TARGET_RENESAS/TARGET_RA/TARGET_RA6M3/TARGET_RA6M3_HMI_BOARD/PeripheralPins.c
const PinMap PinMap_UART_TX[] = {
    {P1_1, UART_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI0_2_4_6_8, RA_PIN_SPEED_MID)},
    {P1_5, UART_8, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI0_2_4_6_8, RA_PIN_SPEED_MID)},
    {P1_9, UART_9, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P1_12, UART_2, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI0_2_4_6_8, RA_PIN_SPEED_MID)},
    {P2_3, UART_9, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P2_5, UART_4, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI0_2_4_6_8, RA_PIN_SPEED_MID)},
    {P2_13, UART_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P3_2, UART_2, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI0_2_4_6_8, RA_PIN_SPEED_MID)},
    {P4_1, UART_7, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P4_11, UART_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI0_2_4_6_8, RA_PIN_SPEED_MID)},
    {P5_1, UART_5, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P5_6, UART_6, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI0_2_4_6_8, RA_PIN_SPEED_MID)},
    {P5_12, UART_4, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI0_2_4_6_8, RA_PIN_SPEED_MID)},
    {P6_2, UART_9, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P6_13, UART_7, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P7_9, UART_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_UP, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {NC, NC, 0}
};

//*** SPI ***
const PinMap PinMap_SPI_MOSI[] = {
    {P1_1, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {P1_9, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {P2_3, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {P3_10, SPI_SCI3, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P4_11, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {P7_1, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {NC, NC, 0}
};
const PinMap PinMap_SPI_MISO[] = {
    {P1_0, SPI_0, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI)},
    {P1_10, SPI_1, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI)},
    {P2_2, SPI_1, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI)},
    {P3_9, SPI_SCI3, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SCI1_3_5_7_9)},
    {P4_10, SPI_0, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI)},
    {P7_0, SPI_1, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI)},
    {NC, NC, 0}
};
const PinMap PinMap_SPI_SCLK[] = {
    {P1_2, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {P1_11, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {P2_4, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {P3_11, SPI_SCI3, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SCI1_3_5_7_9, RA_PIN_SPEED_MID)},
    {P4_12, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {P7_2, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_HS_HIGH)},
    {NC, NC, 0}
};
const PinMap PinMap_SPI_SSEL[] = {
    {P1_3, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P1_4, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P1_5, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P1_6, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P1_8, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P1_12, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P2_5, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P2_6, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P2_7, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P3_0, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P3_1, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P3_2, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P4_6, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P4_7, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P4_13, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P4_14, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P4_15, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P7_3, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P7_4, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P7_5, SPI_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {P7_8, SPI_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_SPI, RA_PIN_SPEED_MID)},
    {NC, NC, 0}
};

//*** I2C ***
const PinMap PinMap_I2C_SCL[] = {
    {P1_0, I2C_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P2_4, I2C_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P2_5, I2C_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P4_0, I2C_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P4_8, I2C_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P5_12, I2C_2, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {NC, NC, 0}
};
const PinMap PinMap_I2C_SDA[] = {
    {P1_1, I2C_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P2_6, I2C_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P4_1, I2C_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P4_7, I2C_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {P5_11, I2C_2, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_OD, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_IIC, RA_PIN_SPEED_MID_I2C)},
    {NC, NC, 0}
};

//*** CAN ***
const PinMap PinMap_CAN_RD[] = {
    {P1_2, CAN_0, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN)},
    {P1_10, CAN_1, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN)},
    {P2_2, CAN_0, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN)},
    {P4_2, CAN_0, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN)},
    {P5_11, CAN_1, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN)},
    {P6_10, CAN_1, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN)},
    {P7_5, CAN_0, RA_PIN_DATA(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN)},
    {NC, NC, 0}
};
const PinMap PinMap_CAN_TD[] = {
    {P1_3, CAN_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN, RA_PIN_SPEED_HS_HIGH)},
    {P1_9, CAN_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN, RA_PIN_SPEED_HS_HIGH)},
    {P2_3, CAN_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN, RA_PIN_SPEED_HS_HIGH)},
    {P4_1, CAN_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN, RA_PIN_SPEED_HS_HIGH)},
    {P5_12, CAN_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN, RA_PIN_SPEED_HS_HIGH)},
    {P6_9, CAN_1, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN, RA_PIN_SPEED_HS_HIGH)},
    {P7_4, CAN_0, RA_PIN_DATA_SPEED(RA_PIN_MODE_PERIPHERAL_PP, RA_PIN_PULL_NONE, IOPORT_PERIPHERAL_CAN, RA_PIN_SPEED_HS_HIGH)},
    {NC, NC, 0}
};
